import React from 'react'

const Blogs = () => {
    return (
        <div style={{ minHeight: '90vh' }}>
            <h2 className='text-center text-primary'>Blogs</h2>
            <div className='text-center mt-4'>
                <h3>জাভাস্ক্রিপ্ট এবং node.js এর মধ্যে পার্থক্য কি? </h3>
                <h5>জাভাস্ক্রিপ্ট হল প্রোগ্রামিং ল্যাঙ্গুয়েজ, আর node.js হল জাভাস্ক্রিপ্টের একটি রানটাইম।
                    node.js হলো একটি ওপেনসোর্স জাভাস্ক্রিপ্ট টাইম জাভাস্ক্রিপ্টে server-side এ চালানোর সুযোগ করে দেয়। জাভাস্ক্রিপ্ট শুধুমাত্র ব্রাউজারে চালানো যায় তবে নোটিশের মাধ্যমে জাভাস্ক্রিপ্ট ব্রাউজার এর বাহিরেও চালানো যায়।জাভাস্ক্রিপ্ট দিয়ে dom মেনুপুলেশন করা যায় তবে node.js দিয়ে dom মেনুপুলেশন করা যায় না। জাভাস্ক্রিপ্ট ফ্রন্ট এন্ড ডেভেলপমেন্ট এর জন্য ইউজ করা হয় আর node.js backend ডেভেলপমেন্ট এর জন্য ইউজ করা হয়। </h5>
            </div>
            <div className='text-center mt-3'>
                <h3>কখন nodejs ব্যবহার করা উচিত এবং কখন আপনার mongodb ব্যবহার করা উচিত</h3>
                <h5>Nodejs হল একটি জাভাস্ক্রিপ্ট ইঞ্জিন যা দিয়ে আপনি যেকোন অ্যাপ্লিকেশন লিখতে পারেন (জাভাস্ক্রিপ্ট ভাষায় প্রোগ্রামিং করে)। এটি আপনার জাভাস্ক্রিপ্ট কোড চালায়। সাধারণত, এটি এমন সার্ভার তৈরি করতে ব্যবহৃত হয় যা ওয়েব অনুরোধে সাড়া দিতে পারে, যদিও এটি অনেক অন্যান্য ধরনের কোডের জন্যও ব্যবহার করা যেতে পারে।

                    MongoDB একটি ডাটাবেস ইঞ্জিন। কিছু অ্যাপ্লিকেশন বা সার্ভারের মধ্যে কোড একটি ডাটাবেসে ডেটা সংরক্ষণ, অনুসন্ধান বা আপডেট করতে MongoDB ব্যবহার করে। node.js দিয়ে তৈরি অনেক ওয়েব সার্ভার আছে যেগুলো ডাটা সংরক্ষণের জন্য MongoDB ব্যবহার করবে।</h5>
            </div>
            <div className='text-center mt-3'>
                <h3>sql এবং no-sql এর মধ্যে পার্থক্য কি? </h3>
                <h5>sql হলো রিলেশনাল ডাটাবেস ম্যানেজমেন্ট সিস্টেম।
                    no-sql হলো নন রিলেশনাল ডাটাবেস ম্যানেজমেন্ট সিস্টেম।
                    sql ডাটাবেসের  fixed স্কিমা আছে. আর no-sql database এর dynamic স্কিমা।

                    sql ডাটাবেজ হায়ারারকিক্যাল ডাটা স্টোরেজের জন্য উপযুক্ত নয়।

                    আর নয় no-sql ডাটাবেজ হায়ারারকিক্যাল ডাটা স্টোরেজের জন্য বেস্ট।</h5>
            </div>
        </div>
    )
}

export default Blogs